Repository: huybach1609/SAPS
Catalog: SAPS.Desktop/SAPLDesktopApp/Resources/TextResource.*.resx
Languages: vi_vn

# ContactAvailableText
source: Contact available
vi_vn: Có thông tin liên lạc

# NotificationReadyForCheckInTitle
source: Ready for Check-In
vi_vn: Sẵn Sàng Check-In

# NotificationReadyForCheckInMessage
source: Vehicle {0} is ready to be checked in. Please review the details and confirm.
vi_vn: Xe {0} đã sẵn sàng để check in. Vui lòng xem xét chi tiết và xác nhận.

# NotificationNoActiveSessionTitle
source: No Active Session
vi_vn: Không Có Phiên Hoạt Động

# NotificationNoActiveSessionMessage
source: No active parking session found for vehicle {0}. The vehicle may not be currently checked in.
vi_vn: Không tìm thấy phiên đỗ xe đang hoạt động cho xe {0}. Xe có thể chưa được check in.

# StatusReadyForCheckOut
source: Ready for Check-Out
vi_vn: Sẵn Sàng Check-Out

# VehicleText
source: Vehicle
vi_vn: Xe

# NotificationReadyForCheckOutTitle
source: Ready for Check-Out
vi_vn: Sẵn Sàng Check-Out

# NotificationReadyForCheckOutMessage
source: {0} ({1}) is ready to be checked out. Parking duration: {2}, Fee: {3}
vi_vn: {0} ({1}) đã sẵn sàng để check out. Thời gian đỗ: {2}, Phí: {3}

# NotificationProcessingCheckOutFailedMessage
source: Failed to process check-out for vehicle {0}. Please try again or contact support.
vi_vn: Không thể xử lý check-out cho xe {0}. Vui lòng thử lại hoặc liên hệ hỗ trợ.

# NotificationAuthenticationErrorTitle
source: Authentication Error
vi_vn: Lỗi Xác Thực

# NotificationAuthenticationErrorMessage
source: User authentication information not available. Please login again.
vi_vn: Thông tin xác thực người dùng không khả dụng. Vui lòng đăng nhập lại.

# NotificationSuccessfullyCheckedInMessage
source: Successfully checked in!
vi_vn: Check in thành công!

# NotificationSuccessfullyCheckedOutWithFeeMessage
source: Successfully checked out! Fee: {0}
vi_vn: Check out thành công! Phí: {0}

# NotificationFailedToConfirmActionMessage
source: Failed to confirm action: {0}
vi_vn: Không thể xác nhận thao tác: {0}

# NotificationRefreshErrorTitle
source: Refresh Error
vi_vn: Lỗi Làm Mới

# NotificationRefreshIncidentDetailsFailedMessage
source: Failed to refresh incident details: {0}
vi_vn: Không thể làm mới chi tiết sự cố: {0}

# NotificationStatusUpdatedTitle
source: Status Updated
vi_vn: Đã Cập Nhật Trạng Thái

# NotificationStatusUpdatedMessage
source: Incident status updated to '{0}' successfully.
vi_vn: Trạng thái sự cố đã được cập nhật thành '{0}' thành công.

# NotificationUpdateErrorTitle
source: Update Error
vi_vn: Lỗi Cập Nhật

# NotificationUpdateIncidentStatusFailedMessage
source: Failed to update incident status: {0}
vi_vn: Không thể cập nhật trạng thái sự cố: {0}

# NotificationFileErrorTitle
source: File Error
vi_vn: Lỗi Tệp

# NotificationUnableToOpenEvidenceFileMessage
source: Unable to open the evidence file.
vi_vn: Không thể mở tệp bằng chứng.

# OneEvidenceFileMessage
source: 1 evidence file
vi_vn: 1 tệp bằng chứng

# MultipleEvidenceFilesMessage
source: {0} evidence files
vi_vn: {0} tệp bằng chứng

# NotificationLoadingErrorTitle
source: Loading Error
vi_vn: Lỗi Tải Dữ Liệu

# NotificationFailedToLoadIncidentReportsMessage
source: Failed to load incident reports. Please try refreshing.
vi_vn: Không thể tải báo cáo sự cố. Vui lòng thử làm mới.

# NotificationFailedToRefreshIncidentReportsMessage
source: Failed to refresh incident reports. Please try again.
vi_vn: Không thể làm mới báo cáo sự cố. Vui lòng thử lại.

# NotificationNotFoundTitle
source: Not Found
vi_vn: Không Tìm Thấy

# NotificationIncidentReportDetailsCouldNotBeLoadedMessage
source: Incident report details could not be loaded.
vi_vn: Không thể tải chi tiết báo cáo sự cố.

# NotificationFailedToLoadIncidentReportDetailsMessage
source: Failed to load incident report details: {0}
vi_vn: Không thể tải chi tiết báo cáo sự cố: {0}

# SearchResultSummaryMessage
source: Found {0} of {1} incident reports
vi_vn: Tìm thấy {0} trong {1} báo cáo sự cố

# MyIncidentReportsSummaryMessage
source: My Incident Reports: {0}
vi_vn: Báo Cáo Sự Cố Của Tôi: {0}

# LoginSuccessMessage
source: Login successful!
vi_vn: Đăng nhập thành công!

# LoginErrorInvalidCredentials
source: Invalid email or password
vi_vn: Email hoặc mật khẩu không hợp lệ

# LoginErrorServiceUnavailable
source: Authentication service unavailable
vi_vn: Dịch vụ xác thực không khả dụng

# LoginErrorServerError
source: Server error occurred. Please try again later.
vi_vn: Đã xảy ra lỗi máy chủ. Vui lòng thử lại sau.

# LoginErrorNetworkError
source: Network error: {0}
vi_vn: Lỗi mạng: {0}

# LoginErrorLoginFailed
source: Login failed: {0}
vi_vn: Đăng nhập thất bại: {0}

# LoginErrorUnexpected
source: An unexpected error occurred: {0}
vi_vn: Đã xảy ra lỗi không mong muốn: {0}

# ForgotPasswordMessage
source: Please contact your administrator to reset your password.
vi_vn: Vui lòng liên hệ quản trị viên để đặt lại mật khẩu.

# ValidationEmailRequired
source: Email is required
vi_vn: Yêu cầu nhập email

# ValidationEmailInvalid
source: Please enter a valid email address
vi_vn: Vui lòng nhập địa chỉ email hợp lệ

# LoginErrorAuthenticationFailed
source: Authentication failed - user information not available
vi_vn: Xác thực thất bại - thông tin người dùng không khả dụng

# LoginErrorFailedToOpenApplication
source: Failed to open application: {0}
vi_vn: Không thể mở ứng dụng: {0}

# GreetingGoodMorning
source: Good morning
vi_vn: Chào buổi sáng

# GreetingGoodAfternoon
source: Good afternoon
vi_vn: Chào buổi chiều

# GreetingGoodEvening
source: Good evening
vi_vn: Chào buổi tối

# ErrorLicensePlateNotReadable
source: License plate detected but could not read the number clearly
vi_vn: Đã phát hiện biển số xe nhưng không thể đọc rõ số

# ErrorFailedToCheckInVehicle
source: Failed to check in vehicle {0}
vi_vn: Không thể check in xe {0}

# ErrorVehicleNotCurrentlyCheckedIn
source: Vehicle {0} is not currently checked in
vi_vn: Xe {0} hiện không được check in

# ErrorFailedToCheckOutVehicle
source: Failed to check out vehicle {0}
vi_vn: Không thể check out xe {0}

# AutomaticCheckInSuccessMessage
source: Vehicle automatically checked in from camera {0}
vi_vn: Xe đã được check in tự động từ camera {0}

# AutomaticCheckOutSuccessMessage
source: Vehicle automatically checked out from camera {0}. Fee: {1}
vi_vn: Xe đã được check out tự động từ camera {0}. Phí: {1}

# ManualProcessingRequiredTitle
source: Manual Processing Required
vi_vn: Cần Xử Lý Thủ Công

# ErrorUnknownPage
source: Unknown page: {0}
vi_vn: Trang không xác định: {0}

# CameraSettingsAppliedTitle
source: Camera Settings Applied
vi_vn: Đã Áp Dụng Cài Đặt Camera

# CameraSettingsAppliedMessage
source: Camera assignments have been updated and applied successfully.
vi_vn: Phân công camera đã được cập nhật và áp dụng thành công.

# CameraSettingsErrorTitle
source: Camera Settings Error
vi_vn: Lỗi Cài Đặt Camera

# CameraSettingsErrorMessage
source: Failed to apply camera settings. Please try again or restart the application.
vi_vn: Không thể áp dụng cài đặt camera. Vui lòng thử lại hoặc khởi động lại ứng dụng.

# NotificationFailedToLoadParkingSessionsMessage
source: Failed to load parking sessions. Please try refreshing.
vi_vn: Không thể tải phiên đỗ xe. Vui lòng thử làm mới.

# NotificationFailedToRefreshParkingSessionsMessage
source: Failed to refresh parking sessions. Please try again.
vi_vn: Không thể làm mới phiên đỗ xe. Vui lòng thử lại.

# NotificationSessionNotFoundTitle
source: Session Not Found
vi_vn: Không Tìm Thấy Phiên

# NotificationCouldNotLoadSessionDetailsMessage
source: Could not load details for parking session {0}
vi_vn: Không thể tải chi tiết cho phiên đỗ xe {0}

# NotificationFailedToLoadSessionDetailsMessage
source: Failed to load session details: {0}
vi_vn: Không thể tải chi tiết phiên: {0}

# ParkingSessionSearchResultSummaryMessage
source: Found {0} of {1} sessions ({2} finished, {3} parking)
vi_vn: Tìm thấy {0} trong {1} phiên đỗ ({2} đã hoàn thành, {3} đang đỗ)

# ParkingSessionTotalSummaryMessage
source: Total Sessions: {0} ({1} finished, {2} parking)
vi_vn: Tổng số phiên đỗ: {0} ({1} hoàn thành, {2} đang đỗ)

# NotificationFailedToLoadShiftDiariesMessage
source: Failed to load shift diaries. Please try refreshing.
vi_vn: Lỗi khi tải nhật ký ca làm. Xin hãy thử lại

# NotificationFailedToRefreshShiftDiariesMessage
source: Failed to refresh shift diaries. Please try again.
vi_vn: Lỗi khi tải lại nhật ký ca làm. Xin hãy thử lại.

# NotificationShiftDiaryDetailsCouldNotBeLoadedMessage
source: Shift diary details could not be loaded.
vi_vn: Không thể tải được chi tiết nhật ký ca làm.

# NotificationFailedToLoadShiftDiaryDetailsMessage
source: Failed to load shift diary details: {0}
vi_vn: Lỗi khỉ tải chi tiết nhật ký ca làm: {0}

# ShiftDiarySearchResultSummaryMessage
source: Found {0} of {1} shift diaries
vi_vn: Tìm thấy {0} trong {1} nhật ký ca làm

# ShiftDiaryTotalSummaryMessage
source: Shift Diaries: {0}
vi_vn: Nhật ký ca làm: {0}

# NoHeaderProvidedText
source: No header provided
vi_vn: Không có tiêu đề

# UnknownSenderText
source: Unknown sender
vi_vn: Người gửi không xác định

# NoContentProvidedText
source: No content provided
vi_vn: Không có nội dung

# CameraFeedFrontEntranceGate
source: Front Entrance Gate
vi_vn: Cổng Vào Phía Trước

# CameraFeedBackEntranceGate
source: Back Entrance Gate
vi_vn: Cổng Vào Phía Sau

# CameraFeedFrontExitGate
source: Front Exit Gate
vi_vn: Cổng Ra Phía Trước

# CameraFeedBackExitGate
source: Back Exit Gate
vi_vn: Cổng Ra Phía Sau

# ParkingStatusParking
source: Parking
vi_vn: Đang Đỗ

# ParkingStatusCheckedOut
source: Checked Out
vi_vn: Đã Check Out

# ParkingStatusFinished
source: Finished
vi_vn: Hoàn Thành

# PaymentStatusPaid
source: Paid
vi_vn: Đã Thanh Toán

# PaymentStatusNotPaid
source: Not Paid
vi_vn: Chưa Thanh Toán

# PaymentStatusPending
source: Pending
vi_vn: Đang Chờ

# DataTableClearFilter
source: Clear Filter
vi_vn: Xóa Bộ Lọc

# DataTableSearchPlaceholder
source: Search...
vi_vn: Tìm kiếm...

# DataTableAllFilter
source: All
vi_vn: Tất Cả

# PaginationFirstPage
source: « First
vi_vn: « Đầu

# PaginationPreviousPage
source: ‹ Previous
vi_vn: ‹ Trước

# PaginationNextPage
source: Next ›
vi_vn: Tiếp ›

# PaginationLastPage
source: Last »
vi_vn: Cuối »

# RoleStaff
source: Staff
vi_vn: Nhân Viên

# BtnDownload
source: Download
vi_vn: Tải xuống

# BtnOpen
source: Open
vi_vn: Mở

# BtnDownloading
source: Downloading...
vi_vn: Đang tải...

# StatusDownloaded
source: Downloaded
vi_vn: Đã tải xuống

# StatusNotDownloaded
source: Not Downloaded
vi_vn: Chưa tải xuống

# NotificationDownloadCompleteTitle
source: Download Complete
vi_vn: Hoàn thành tải xuống

# NotificationDownloadFailedTitle
source: Download Failed
vi_vn: Tải xuống thất bại

# NotificationFileOperationFailedTitle
source: File Operation Failed
vi_vn: Thao tác tệp thất bại

# NotificationDownloadCompleteMessage
source: File '{0}' has been downloaded successfully.
vi_vn: Tệp '{0}' đã được tải xuống thành công.

# NotificationDownloadFailedMessage
source: Failed to download '{0}': {1}
vi_vn: Không thể tải xuống '{0}': {1}

# NotificationFileOperationFailedMessage
source: Failed to open or download file: {0}
vi_vn: Không thể mở hoặc tải xuống tệp: {0}

# BtnOpenURL
source: Open URL
vi_vn: Mở URL

# NotificationLicensePlateDetectionTitle
source: License Plate Detection
vi_vn: Phát Hiện Biển Số Xe

# NotificationLicensePlateUnreadableMessage
source: Camera {0}: License plate detected but text could not be read clearly. Manual processing may be required.
vi_vn: Camera {0}: Đã phát hiện biển số xe nhưng không thể đọc rõ văn bản. Có thể cần xử lý thủ công.

# ContentText
source: Content
vi_vn: Nội dung

# TooltipManuallyCheckIn
source: Manually Check in
vi_vn: Check in thủ công

# TooltipManuallyCheckOut
source: Manually Check out
vi_vn: Check out thủ công

# ForgotPasswordWindowTitle
source: Reset Password
vi_vn: Đặt Lại Mật Khẩu

# ForgotPasswordTitle
source: Forgot Password?
vi_vn: Quên Mật Khẩu?

# ForgotPasswordDescription
source: Enter your registered email address and we'll send you instructions to reset your password.
vi_vn: Nhập địa chỉ email đã đăng ký và chúng tôi sẽ gửi hướng dẫn đặt lại mật khẩu cho bạn.

# ForgotPasswordSendRequestButton
source: Send Reset Request
vi_vn: Gửi Yêu Cầu Đặt Lại

# ForgotPasswordBackToLoginButton
source: Back to Login
vi_vn: Quay Lại Đăng Nhập

# ForgotPasswordSendingRequest
source: Sending reset request...
vi_vn: Đang gửi yêu cầu đặt lại...

# ForgotPasswordRequestSentMessage
source: Password reset instructions have been sent to your email address.
vi_vn: Hướng dẫn đặt lại mật khẩu đã được gửi đến địa chỉ email của bạn.

# ForgotPasswordRequestFailedMessage
source: Failed to send reset request: {0}
vi_vn: Không thể gửi yêu cầu đặt lại: {0}

# BtnRefreshSession
source: Refresh Session
vi_vn: Làm Mới Phiên

# NotificationSessionRefreshedMessage
source: Session details have been refreshed successfully.
vi_vn: Chi tiết phiên đã được làm mới thành công.

# NotificationRefreshSessionFailedMessage
source: Failed to refresh session details: {0}
vi_vn: Không thể làm mới chi tiết phiên: {0}

# PaymentInfoWindowTitle
source: Payment Information
vi_vn: Thông tin thanh toán

# PaymentInfoTitle
source: Payment Information
vi_vn: Thông tin thanh toán

# PaymentQRCodeUnavailable
source: QR Code not available
vi_vn: QR Code không khả dụng

# PaymentBankLabel
source: Bank
vi_vn: Ngân hàng

# PaymentAccountHolderLabel
source: Account Holder:
vi_vn: Chủ tài khoản:

# PaymentAccountNumberLabel
source: Account Number:
vi_vn: Số tài khoản:

# PaymentAmountLabel
source: Amount:
vi_vn: Số tiền:

# PaymentDescriptionLabel
source: Description:
vi_vn: Nội dung:

# PaymentCopyButton
source: Copy
vi_vn: Sao chép

# PaymentCloseButton
source: Close
vi_vn: Đóng

# PaymentInstructionsTitle
source: 💡 Payment Instructions
vi_vn: 💡 Hướng dẫn thanh toán

# PaymentInstruction1
source: 1. Open your banking app or e-wallet
vi_vn: 1. Mở ứng dụng ngân hàng hoặc ví điện tử

# PaymentInstruction2
source: 2. Scan QR code or enter transfer information
vi_vn: 2. Quét mã QR hoặc nhập thông tin chuyển khoản

# PaymentInstruction3
source: 3. Check information and confirm payment
vi_vn: 3. Kiểm tra thông tin và xác nhận thanh toán

# PaymentInfoButtonText
source: View Payment Information
vi_vn: Xem thông tin thanh toán

# CloseSidebarTooltip
source: Close Sidebar
vi_vn: Đóng thanh bên

# CloseTooltip
source: Close
vi_vn: Đóng
