Repository: huybach1609/SAPS
Catalog: SAPS.Desktop/SAPLDesktopApp/Resources/TextResource.*.resx
Languages: vi_vn

# AppTitle
source: SAPLS - Staff Portal
vi_vn: SAPLS - Cổng Nhân Viên

# AppSubtitle
source: Staff Desktop
vi_vn: Ứng Dụng Desktop Nhân Viên

# AppPortalName
source: SAPLS Staff Portal
vi_vn: Cổng Nhân Viên SAPLS

# AppDescription
source: Semi-Automatic Parking Lot System
vi_vn: Hệ Thống Bãi Đỗ Xe Bán Tự Động

# AppPortalDescription
source: Staff Desktop Portal
vi_vn: Cổng Desktop Nhân Viên

# NavCameraTitle
source: Camera Monitoring
vi_vn: Giám Sát Camera

# NavParkingSessionsTitle
source: Parking Sessions
vi_vn: Phiên Đậu Xe

# NavShiftDiariesTitle
source: Shift Diaries
vi_vn: Nhật Ký Ca Làm

# NavIncidenceReportsTitle
source: Incidence Reports
vi_vn: Báo Cáo Sự Cố

# BtnBack
source: ← Back
vi_vn: ← Quay Lại

# BtnCancel
source: Cancel
vi_vn: Hủy Bỏ

# BtnClear
source: Clear
vi_vn: Xóa

# BtnClearForm
source: Clear Form
vi_vn: Xóa Biểu Mẫu

# BtnProcess
source: Process
vi_vn: Xử Lý

# BtnCapture
source: Capture
vi_vn: Chụp

# BtnCaptureAll
source: Capture All
vi_vn: Chụp Tất Cả

# BtnRefreshAll
source: Refresh All
vi_vn: Làm Mới Tất Cả

# BtnFullView
source: Full View
vi_vn: Xem Toàn Màn Hình

# BtnViewFullImage
source: View Full Image
vi_vn: Xem Ảnh Đầy Đủ

# BtnAttachFile
source: Attach File
vi_vn: Đính Kèm Tệp

# BtnSubmitReport
source: Submit Report
vi_vn: Gửi Báo Cáo

# BtnCheckOut
source: Check Out Vehicle
vi_vn: Check Out Xe

# BtnCheckInManually
source: Check-in manually
vi_vn: Check-in Thủ Công

# BtnCheckOutManually
source: Check-out manually
vi_vn: Check-out Thủ Công

# BtnLogout
source: Logout
vi_vn: Đăng Xuất

# BtnExit
source: Exit
vi_vn: Thoát

# BtnSettings
source: Settings
vi_vn: Cài Đặt

# BtnYes
source: Yes
vi_vn: Có

# BtnNo
source: No
vi_vn: Không

# BtnRestart
source: Restart
vi_vn: Khởi động lại

# ConfirmButtonText
source: Confirm
vi_vn: Xác Nhận

# LoginWindowTitle
source: SAPLS - Staff Login
vi_vn: SAPLS - Đăng Nhập Nhân Viên

# LoginHeaderText
source: Staff Login
vi_vn: Đăng Nhập Nhân Viên

# LoginSubHeaderText
source: Enter your credentials to access the system
vi_vn: Nhập thông tin đăng nhập để truy cập hệ thống

# LoginButton
source: Log In
vi_vn: Đăng Nhập

# LabelPassword
source: Password
vi_vn: Mật Khẩu

# PasswordPlaceHolder
source: Enter your password
vi_vn: Nhập mật khẩu của bạn

# EnterEmailPlaceholder
source: Enter your email address
vi_vn: Nhập địa chỉ email của bạn

# ForgotPasswordText
source: Forgot Password?
vi_vn: Quên Mật Khẩu?

# RememberMeText
source: Remember me
vi_vn: Ghi nhớ đăng nhập

# SettingsTitle
source: ⚙️ Settings
vi_vn: ⚙️ Cài Đặt

# SettingsGeneralTitle
source: General Settings
vi_vn: Cài Đặt Chung

# SettingsCameraTitle
source: Camera Settings
vi_vn: Cài Đặt Camera

# SettingsLanguageTitle
source: Language
vi_vn: Ngôn Ngữ

# SettingsSaveButton
source: Save Settings
vi_vn: Lưu Cài Đặt

# SettingsCancelButton
source: Cancel
vi_vn: Hủy

# ChangePasswordTitle
source: 🔒 Change Password
vi_vn: 🔒 Đổi Mật Khẩu

# CurrentPasswordLabel
source: Current Password *
vi_vn: Mật Khẩu Hiện Tại *

# NewPasswordLabel
source: New Password *
vi_vn: Mật Khẩu Mới *

# ConfirmPasswordLabel
source: Confirm Password *
vi_vn: Xác Nhận Mật Khẩu *

# EnterCurrentPasswordPlaceholder
source: Enter current password
vi_vn: Nhập mật khẩu hiện tại

# EnterNewPasswordPlaceholder
source: Enter new password
vi_vn: Nhập mật khẩu mới

# ConfirmNewPasswordPlaceholder
source: Confirm new password
vi_vn: Xác nhận mật khẩu mới

# ChangePasswordButtonText
source: Change Password
vi_vn: Đổi Mật Khẩu

# LanguageSettingsTitle
source: 🌍 Language Settings
vi_vn: 🌍 Cài Đặt Ngôn Ngữ

# LanguageSelectionDescription
source: Select your preferred language for the application interface
vi_vn: Chọn ngôn ngữ ưa thích cho giao diện ứng dụng

# LanguageEnglish
source: English
vi_vn: Tiếng Anh

# LanguageVietnamese
source: Vietnamese
vi_vn: Tiếng Việt

# LanguageChangeTitle
source: Change Language
vi_vn: Thay đổi ngôn ngữ

# LanguageChangeConfirmMessage
source: Changing the language to {0} requires the application to restart. Do you want to continue?
vi_vn: Thay đổi ngôn ngữ sang {0} yêu cầu khởi động lại ứng dụng. Bạn có muốn tiếp tục không?

# CameraEntranceFront
source: ENTRANCE FRONT
vi_vn: CAMERA VÀO PHÍA TRƯỚC

# CameraExitFront
source: EXIT FRONT
vi_vn: CAMERA RA PHÍA TRƯỚC

# CameraEntranceBack
source: ENTRANCE BACK
vi_vn: CAMERA VÀO PHÍA SAU

# CameraExitBack
source: EXIT BACK
vi_vn: CAMERA RA PHÍA SAU

# AvailableCamerasTitle
source: Available Cameras
vi_vn: Camera Khả Dụng

# CameraAssignmentsTitle
source: Camera Assignments
vi_vn: Phân Công Camera

# FrontEntranceLabel
source: Front Entrance:
vi_vn: Lối Vào Phía Trước:

# BackEntranceLabel
source: Back Entrance:
vi_vn: Lối Vào Phía Sau:

# FrontExitLabel
source: Front Exit:
vi_vn: Lối Ra Phía Trước:

# BackExitLabel
source: Back Exit:
vi_vn: Lối Ra Phía Sau:

# SelectCameraPlaceholder
source: Select camera...
vi_vn: Chọn camera...

# AvailableStatusText
source: Available
vi_vn: Khả Dụng

# UnavailableStatusText
source: Unavailable
vi_vn: Không Khả Dụng

# NoPreviewText
source: No Preview
vi_vn: Không Có Xem Trước

# LiveIndicatorText
source: ● LIVE
vi_vn: ● TRỰC TIẾP

# CapturedImagesTitle
source: 📸 Captured Images
vi_vn: 📸 Ảnh Đã Chụp

# EntranceCamerasText
source: Entrance Cameras
vi_vn: Camera Lối Vào

# ExitCamerasText
source: Exit Cameras
vi_vn: Camera Lối Ra

source: No entrance images captured
vi_vn: Chưa chụp ảnh lối vào nào

source: No exit images captured
vi_vn: Chưa chụp ảnh lối ra nào

# LabelPlateNumber
source: PlateNo
vi_vn: Biển Số

# LabelDriverName
source: Driver Name
vi_vn: Tên Tài Xế

# LabelPhoneNumber
source: PhoneNo
vi_vn: Số Điện Thoại

# LabelOwnerPhoneNumber
source: Phone Number
vi_vn: Số Điện Thoại

# LabelEntryTime
source: Entry Time
vi_vn: Giờ Vào

# LabelExitTime
source: Exit Time
vi_vn: Giờ Ra

# LabelDuration
source: Duration
vi_vn: Thời Gian

# LabelStatus
source: Status
vi_vn: Trạng Thái

# LabelFee
source: Fee
vi_vn: Phí

# LabelVehicleType
source: Vehicle Type
vi_vn: Loại Xe

# LabelImages
source: Images
vi_vn: Hình Ảnh

# LabelVehicleImages
source: Vehicle Images
vi_vn: Hình Ảnh Xe

# LabelEntranceCameras
source: Entrance Cameras
vi_vn: Camera Lối Vào

# LabelExitCameras
source: Exit Cameras
vi_vn: Camera Lối Ra

# LabelFrontCamera
source: Front Camera
vi_vn: Camera Phía Trước

# LabelBackCamera
source: Back Camera
vi_vn: Camera Phía Sau

# LabelOwnerFullName
source: Full Name
vi_vn: Họ Tên Đầy Đủ

# LabelVehicleColor
source: Color
vi_vn: Màu Sắc

# LabelVehicleBrand
source: Brand
vi_vn: Thương Hiệu

# LabelVehicleModel
source: Model Code
vi_vn: Mã Model

# NameLabel
source: Name
vi_vn: Tên

# AuthorLabel
source: Author
vi_vn: Tác Giả

# CreatedDateLabel
source: Created Date
vi_vn: Ngày Tạo

# OwnerInformationTitle
source: Owner Information
vi_vn: Thông Tin Chủ Xe

# VehicleInformationTitle
source: Vehicle Information
vi_vn: Thông Tin Xe

# ParkingInformationTitle
source: Parking Information
vi_vn: Thông Tin Đỗ Xe

# SessionInformationTitle
source: Session Information
vi_vn: Thông Tin Phiên

# IncidentInformationTitle
source: Incident Information
vi_vn: Thông Tin Sự Cố

# BasicInformationTitle
source: Basic Information
vi_vn: Thông Tin Cơ Bản

# AdditionalInformationTitle
source: Additional Information
vi_vn: Thông Tin Bổ Sung

# DiaryInformationTitle
source: Diary Information
vi_vn: Thông Tin Nhật Ký

# ContentTitle
source: Content
vi_vn: Nội Dung

# ActionsTitle
source: 🎯 Actions
vi_vn: 🎯 Thao Tác

# VehicleDetailsTitle
source: 🚗 Vehicle Details
vi_vn: 🚗 Chi Tiết Xe

# LicensePlateNumberTitle
source: 🔢 License Plate Number
vi_vn: 🔢 Số Biển Xe

# VehicleTypeTitle
source: 🚙 Vehicle Type
vi_vn: 🚙 Loại Xe

# HistoryDetailsTitle
source: Parking History Details
vi_vn: Chi Tiết Lịch Sử Đỗ Xe

# IncidentReportDetailsTitle
source: Incident Report Details
vi_vn: Chi Tiết Báo Cáo Sự Cố

# AddIncidentReportTitle
source: Add Incident Report
vi_vn: Thêm Báo Cáo Sự Cố

# CreateShiftDiaryTitle
source: Create Shift Diary
vi_vn: Tạo Nhật Ký Ca Làm

# ShiftDiaryDetailsTitle
source: Shift Diary Details
vi_vn: Chi Tiết Nhật Ký Ca Làm

# ParkingSessionsPageTitle
source: 🚗 Parking Sessions
vi_vn: 🚗 Phiên Đỗ Xe

# VehiclesPageDescription
source: Monitor and manage vehicles currently in the parking area
vi_vn: Giám sát và quản lý các xe hiện đang trong bãi đỗ

# HistoryPageDescription
source: View complete history of vehicle entries and exits
vi_vn: Xem lịch sử đầy đủ về việc vào ra của các xe

# IncidentReportsPageDescription
source: Your submitted incident reports and their current status
vi_vn: Các báo cáo sự cố đã gửi và trạng thái hiện tại của chúng

# ParkingSessionsPageDescription
source: Monitor current vehicles and view parking history
vi_vn: Giám sát xe hiện tại và xem lịch sử đỗ xe

# ShiftDiariesPageDescription
source: View and manage shift diary entries
vi_vn: Xem và quản lý các mục nhật ký ca làm

# IncidentReportsTitle
source: ⚠️ Incident Reports
vi_vn: ⚠️ Báo Cáo Sự Cố

# LabelIncidentId
source: Incident ID
vi_vn: Mã Sự Cố

# LabelIncidentHeader
source: Header
vi_vn: Tiêu Đề

# LabelIncidentDescription
source: Description
vi_vn: Mô Tả

# LabelIncidentPriority
source: Priority
vi_vn: Độ Ưu Tiên

# LabelReportedDate
source: Reported Date
vi_vn: Ngày Báo Cáo

# PriorityLevelLabel
source: Priority Level
vi_vn: Mức Độ Ưu Tiên

# AttachmentsLabel
source: Attachments
vi_vn: Tệp Đính Kèm

# AttachedEvidenceLabel
source: Attached Evidence
vi_vn: Bằng Chứng Đính Kèm

# NoEvidenceAttachedMessage
source: No evidence files attached
vi_vn: Không có tệp bằng chứng đính kèm

# IncidentNotesLabel
source: Notes
vi_vn: Ghi Chú

# AddIncidentReportStatusMessage
source: Complete the form below to submit a new incident report
vi_vn: Hoàn thành biểu mẫu dưới đây để gửi báo cáo sự cố mới

# RequiredFieldsNote
source: * Required fields
vi_vn: * Trường bắt buộc

# HeaderTitleLabel
source: Header/Title *
vi_vn: Tiêu Đề/Đầu Đề *

# ContentLabel
source: Content *
vi_vn: Nội Dung *

# CreateDiaryButtonText
source: Create Diary
vi_vn: Tạo Nhật Ký

# CreateNewDiaryButtonText
source: 📝 Create New Diary
vi_vn: 📝 Tạo Nhật Ký Mới

# ShiftDiariesPageTitle
source: 📋 Shift Diaries
vi_vn: 📋 Nhật Ký Ca Làm

# CreatedDateHeaderText
source: Created Date
vi_vn: Ngày Tạo

# TimeHeaderText
source: Time
vi_vn: Thời Gian

# HeaderColumnText
source: Header
vi_vn: Tiêu Đề

# AuthorHeaderText
source: Author
vi_vn: Tác Giả

# PayStatusLabel
source: Pay status
vi_vn: Trạng thái thanh toán

# DurationLabel
source: Duration:
vi_vn: Thời gian:

# FeeLabel
source: Fee:
vi_vn: Phí:

# StatusResolved
source: Resolved
vi_vn: Đã Giải Quyết

# StatusUnderInvestigation
source: Under Investigation
vi_vn: Đang Điều Tra

# StatusParking
source: Parking
vi_vn: Đang Đỗ

# StatusCheckedOut
source: Checked-out
vi_vn: Đã Check-out

# StatusConnected
source: Connected
vi_vn: Đã Kết Nối

# StatusDisconnected
source: Disconnected
vi_vn: Mất Kết Nối

# StatusLoading
source: Loading...
vi_vn: Đang Tải...

# StatusProcessing
source: Processing...
vi_vn: Đang Xử Lý...

# StatusSuccess
source: Success
vi_vn: Thành Công

# StatusError
source: Error
vi_vn: Lỗi

# StatusOpen
source: Open
vi_vn: Mở

# StatusInProgress
source: In Progress
vi_vn: Đang Thực Hiện

# StatusClosed
source: Closed
vi_vn: Đã Đóng

# StatusCompleted
source: Completed
vi_vn: Hoàn Thành

# StatusCurrentlyParked
source: Currently Parked
vi_vn: Hiện Đang Đỗ

# PriorityLow
source: Low
vi_vn: Thấp

# PriorityMedium
source: Medium
vi_vn: Trung Bình

# PriorityHigh
source: High
vi_vn: Cao

# PriorityCritical
source: Critical
vi_vn: Khẩn Cấp

# ProcessManualCheckin
source: Manual Check-in
vi_vn: Check-in Thủ Công

# ProcessManualCheckout
source: Manual Check-out
vi_vn: Check-out Thủ Công

# CaptureButtonText
source: 📸 Capture
vi_vn: 📸 Chụp

# PlaceholderPlateNumberLong
source: Enter plate number
vi_vn: Nhập biển số xe

# EnterLicensePlatePlaceholder
source: Enter license plate...
vi_vn: Nhập biển số xe...

# HeaderDiaryPlaceholder
source: Enter diary header or title...
vi_vn: Nhập tiêu đề hoặc đầu đề nhật ký...

# ContentDiaryPlaceholder
source: Enter diary content...
vi_vn: Nhập nội dung nhật ký...

# IncidentHeaderWatermark
source: Enter a brief title for the incident
vi_vn: Nhập tiêu đề ngắn gọn cho sự cố

# ReporterNameWatermark
source: Enter reporter name
vi_vn: Nhập tên người báo cáo

# IncidentDescriptionWatermark
source: Provide a detailed description of the incident
vi_vn: Cung cấp mô tả chi tiết về sự cố

# IncidentNotesWatermark
source: Add any additional notes or comments
vi_vn: Thêm ghi chú hoặc bình luận bổ sung

# IncidentReportsSearchPlaceholder
source: Search by ID, type, description, or status...
vi_vn: Tìm theo mã, loại, mô tả hoặc trạng thái...

# ParkingSessionsSearchPlaceholder
source: Search by license plate, driver name, or phone...
vi_vn: Tìm theo biển số, tên tài xế hoặc điện thoại...

# SearchShiftDiariesPlaceholder
source: Search shift diaries...
vi_vn: Tìm nhật ký ca làm...

# FilterStatusLabel
source: Status:
vi_vn: Trạng thái:

# FilterAllOption
source: All
vi_vn: Tất Cả

# FilterActiveOption
source: Active
vi_vn: Đang Hoạt Động

# FilterCompletedOption
source: Completed
vi_vn: Hoàn Thành

# FrontCameraLabel
source: Front
vi_vn: Phía Trước

# BackCameraLabel
source: Back
vi_vn: Phía Sau

# ViewButtonText
source: View
vi_vn: Xem

# OpenButtonText
source: Open
vi_vn: Mở

# RemoveButtonText
source: Remove
vi_vn: Xóa

# CancelButtonText
source: ❌ Cancel
vi_vn: ❌ Hủy

# PaginationPageInfo
source: Page {0} of {1}
vi_vn: Trang {0} trong {1}

# PaginationSinglePage
source: Page 1
vi_vn: Trang 1

# PaginationShowingItems
source: Showing {0}-{1} of {2} items
vi_vn: Hiển thị {0}-{1} trong {2} mục

# PaginationNoItems
source: No items to display
vi_vn: Không có mục nào để hiển thị

# LoadingDefault
source: Loading...
vi_vn: Đang tải...

source: Loading Cameras
vi_vn: Đang Tải Camera

# LoadingCamerasDescription
source: Please wait while we detect and initialize your cameras...
vi_vn: Vui lòng đợi trong khi chúng tôi phát hiện và khởi tạo camera của bạn...

# LoadingDetectingCameras
source: Detecting cameras...
vi_vn: Đang phát hiện camera...

# LoadingScanningDevices
source: Scanning for available camera devices
vi_vn: Đang quét thiết bị camera khả dụng

# LoadingInitializingCamera
source: Initializing {0}...
vi_vn: Đang khởi tạo {0}...

# LoadingSavingSettings
source: Saving settings...
vi_vn: Đang lưu cài đặt...

# LoadingProcessingFiles
source: Processing files...
vi_vn: Đang xử lý tệp...

# LoadingProcessingFile
source: Processing {0}
vi_vn: Đang xử lý {0}

# LoadingPleaseWait
source: Please wait...
vi_vn: Vui lòng đợi...

# LoadingPerformingOperation
source: Performing operation
vi_vn: Đang thực hiện thao tác

# LoadingConnecting
source: Connecting...
vi_vn: Đang kết nối...

# LoadingDisconnecting
source: Disconnecting...
vi_vn: Đang ngắt kết nối...

# LoadingRefreshing
source: Refreshing...
vi_vn: Đang làm mới...

# LoadingCapturing
source: Capturing...
vi_vn: Đang chụp...

# LoadingStarting
source: Starting...
vi_vn: Đang bắt đầu...

# LoadingStopping
source: Stopping...
vi_vn: Đang dừng...

# LoadingConfiguring
source: Configuring...
vi_vn: Đang cấu hình...

# LoadingValidating
source: Validating...
vi_vn: Đang xác thực...

# LoadingSearching
source: Searching...
vi_vn: Đang tìm kiếm...

# LoadingFetching
source: Fetching data...
vi_vn: Đang lấy dữ liệu...

# LoadingUpdating
source: Updating...
vi_vn: Đang cập nhật...

# LoadingDeleting
source: Deleting...
vi_vn: Đang xóa...

# LoadingUploading
source: Uploading...
vi_vn: Đang tải lên...

# LoadingDownloading
source: Downloading...
vi_vn: Đang tải xuống...

# NotificationTitleVehicleCheckIn
source: Vehicle Checked In
vi_vn: Xe Đã Check In

# NotificationTitleVehicleCheckOut
source: Vehicle Checked Out
vi_vn: Xe Đã Check Out

# NotificationTitleError
source: Error
vi_vn: Lỗi

# NotificationTitleWarning
source: Warning
vi_vn: Cảnh Báo

# NotificationTitleInfo
source: Information
vi_vn: Thông Tin

# NotificationTitleSuccess
source: Success
vi_vn: Thành Công

# NotificationTitleAlreadyCheckedIn
source: Already Checked In
vi_vn: Đã Check In

# NotificationTitleNotCheckedIn
source: Not Checked In
vi_vn: Chưa Check In

# NotificationTitleCheckInFailed
source: Check-in Failed
vi_vn: Check-in Thất Bại

# NotificationTitleCheckOutFailed
source: Check-out Failed
vi_vn: Check-out Thất Bại

# NotificationTitleActiveSessions
source: Active Sessions
vi_vn: Phiên Đang Hoạt Động

# NotificationTitleNoActiveSessions
source: No Active Sessions
vi_vn: Không Có Phiên Nào

# NotificationTitleAvailableForCheckOut
source: Available for Check-out
vi_vn: Sẵn Sàng Check-out

# NotificationTitleProcessingError
source: Processing Error
vi_vn: Lỗi Xử Lý

# NotificationMessageVehicleCheckInSuccess
source: Successfully checked in
vi_vn: Check in thành công

# NotificationMessageVehicleCheckOutSuccess
source: Successfully checked out
vi_vn: Check out thành công

# NotificationMessageLicensePlatePrefix
source: License plate:
vi_vn: Biển số:

# NotificationMessageFeePrefix
source: Fee:
vi_vn: Phí:

# NotificationMessageCurrentlyCheckedInVehicles
source: Currently checked-in vehicles:
vi_vn: Xe hiện đang check-in:

# NotificationMessageVehiclesAvailableForCheckOut
source: Vehicles available for check-out:
vi_vn: Xe có thể check-out:

# NotificationMessageNoVehiclesToCheckOut
source: There are no vehicles currently checked in to check out.
vi_vn: Hiện không có xe nào đang check-in để check-out.

# NotificationMessageVehicleAlreadyCheckedIn
source: is already checked in since
vi_vn: đã check in từ

# NotificationMessageVehicleNotCheckedIn
source: is not currently checked in and cannot be checked out
vi_vn: hiện không check-in và không thể check-out

# NotificationMessageFailedToCheckActiveSessions
source: Failed to check active sessions:
vi_vn: Không thể kiểm tra phiên hoạt động:

# NotificationMessageFailedToValidateVehicleStatus
source: Failed to validate vehicle status:
vi_vn: Không thể xác thực trạng thái xe:

# NotificationMessageFailedToConfirmAction
source: Failed to confirm action:
vi_vn: Không thể xác nhận thao tác:

# NotificationDefaultCheckInMessage
source: Successfully processed check-in
vi_vn: Xử lý check-in thành công

# NotificationDefaultCheckOutMessage
source: Successfully processed check-out
vi_vn: Xử lý check-out thành công

# TooltipSettings
source: Camera Settings
vi_vn: Cài Đặt Camera

# TooltipRefreshAll
source: Refresh All
vi_vn: Làm Mới Tất Cả

# TooltipCaptureAll
source: Capture All
vi_vn: Chụp Tất Cả

# TooltipFullView
source: Full View
vi_vn: Xem Toàn Màn Hình

# IncidentDescriptionTooltip
source: Click to view full incident description
vi_vn: Nhấp để xem mô tả sự cố đầy đủ

# WelcomeUser
source: Hello {0}
vi_vn: Xin chào {0}

# ErrorGeneric
source: An error occurred
vi_vn: Đã xảy ra lỗi

# ErrorConnection
source: Connection failed
vi_vn: Kết nối thất bại

# ErrorInvalidInput
source: Invalid input
vi_vn: Dữ liệu đầu vào không hợp lệ

# ErrorPlateNumberRequired
source: Plate number is required
vi_vn: Yêu cầu nhập biển số xe

# ValidationStaffIdRequired
source: Staff ID is required
vi_vn: Yêu cầu nhập mã nhân viên

# ValidationPasswordRequired
source: Password is required
vi_vn: Yêu cầu nhập mật khẩu

# ValidationStaffIdTooShort
source: Staff ID must be at least 3 characters
vi_vn: Mã nhân viên phải có ít nhất 3 ký tự

# ValidationPasswordTooShort
source: Password must be at least 4 characters
vi_vn: Mật khẩu phải có ít nhất 4 ký tự

# SelectVehicleTypeDescription
source: Select vehicle type for this unregistered vehicle
vi_vn: Chọn loại xe cho xe chưa đăng ký này

# SizeLabel
source: Size: {0:N0} bytes
vi_vn: Kích thước: {0:N0} bytes

# UploadedLabel
source: Uploaded: {0:g}
vi_vn: Đã tải lên: {0:g}

# OneAttachmentsMessage
source: 1 attachment
vi_vn: 1 tệp đính kèm

# MultipleAttachmentsMessage
source: {0} attachments
vi_vn: {0} tệp đính kèm

# BtnClearFilter
source: Clear Filter
vi_vn: Xóa Bộ Lọc

# AddIncidentReportButtonText
source: ➕ Add Incident Report
vi_vn: ➕ Thêm Báo Cáo Sự Cố

# NoAttachmentsMessage
source: No attachments
vi_vn: Không có tệp đính kèm

# UnknownUserName
source: Unknown User
vi_vn: Người Dùng Không Xác Định

# IncidenceReportServiceNotRegistered
source: IncidenceReportService is not registered
vi_vn: Dịch vụ báo cáo sự cố chưa được đăng ký

# NotificationIncidentReportCreatedTitle
source: Incident Report Created
vi_vn: Báo Cáo Sự Cố Đã Tạo

# NotificationIncidentReportCreatedMessage
source: Incident report '{0}' has been created successfully.
vi_vn: Báo cáo sự cố '{0}' đã được tạo thành công.

# NotificationIncidentCreationFailedTitle
source: Creation Failed
vi_vn: Tạo Thất Bại

# NotificationIncidentCreationFailedMessage
source: Failed to create incident report: {0}
vi_vn: Không thể tạo báo cáo sự cố: {0}

# ShiftDiaryServiceNotRegistered
source: ShiftDiaryService is not registered
vi_vn: Dịch vụ nhật ký ca làm chưa được đăng ký

# NotificationMissingInformationTitle
source: Missing Information
vi_vn: Thiếu Thông Tin

# NotificationMissingParkingLotMessage
source: Unable to determine parking lot. Please ensure you are properly logged in.
vi_vn: Không thể xác định bãi đỗ xe. Vui lòng đảm bảo bạn đã đăng nhập đúng cách.

# NotificationShiftDiaryCreatedTitle
source: Shift Diary Created
vi_vn: Nhật Ký Ca Làm Đã Tạo

# NotificationShiftDiaryCreatedMessage
source: Shift diary '{0}' has been created successfully.
vi_vn: Nhật ký ca làm '{0}' đã được tạo thành công.

# NotificationShiftDiaryCreationFailedTitle
source: Creation Failed
vi_vn: Tạo Thất Bại

# NotificationShiftDiaryCreationFailedMessage
source: Failed to create shift diary: {0}
vi_vn: Không thể tạo nhật ký ca làm: {0}

# LabelLastDetectedTime
source: Last detected: {0}
vi_vn: Phát hiện lần cuối: {0}

# UnknownOwnerName
source: Unknown Owner
vi_vn: Chủ Xe Không Xác Định

# NotProvidedText
source: Not provided
vi_vn: Không cung cấp

# UnknownVehicleText
source: Unknown Vehicle
vi_vn: Xe Không Xác Định

# ConfirmCheckInButtonText
source: ✅ Confirm Check In
vi_vn: ✅ Xác Nhận Check In

# ConfirmCheckOutButtonText
source: ✅ Confirm Check Out
vi_vn: ✅ Xác Nhận Check Out

# NotificationCameraErrorTitle
source: Camera Error
vi_vn: Lỗi Camera

# NotificationCameraSubscriptionFailedMessage
source: Failed to subscribe to camera events: {0}
vi_vn: Không thể đăng ký sự kiện camera: {0}

# NotificationCheckInPlateDetectedTitle
source: Check-In Plate Detected
vi_vn: Phát Hiện Biển Số Check-In

# NotificationCheckOutPlateDetectedTitle
source: Check-Out Plate Detected
vi_vn: Phát Hiện Biển Số Check-Out

# NotificationAutoFilledMessage
source: Auto-filled: {0}
vi_vn: Tự động điền: {0}

# NotificationEntranceDetectedMessage
source: Entrance detected: {0}
vi_vn: Phát hiện lối vào: {0}

# NotificationExitDetectedMessage
source: Exit detected: {0}
vi_vn: Phát hiện lối ra: {0}

# NotificationFailedToOpenCheckInSidebarMessage
source: Failed to open check-in sidebar: {0}
vi_vn: Không thể mở thanh bên check-in: {0}

# NotificationFailedToOpenCheckOutSidebarMessage
source: Failed to open check-out sidebar: {0}
vi_vn: Không thể mở thanh bên check-out: {0}

# CapturedTimestampFormat
source: Captured: {0}
vi_vn: Đã chụp: {0}

# NotificationProcessingErrorTitle
source: Processing Error
vi_vn: Lỗi Xử Lý

# NotificationProcessingVehicleInfoFailedMessage
source: Failed to process vehicle information: {0}
vi_vn: Không thể xử lý thông tin xe: {0}

# NotificationVehicleNotFoundTitle
source: Vehicle Not Found
vi_vn: Không Tìm Thấy Xe

# NotificationVehicleNotFoundMessage
source: No vehicle found with license plate {0}. Please select a vehicle type for check-in.
vi_vn: Không tìm thấy xe với biển số {0}. Vui lòng chọn loại xe để check-in.

# UnknownText
source: Unknown
vi_vn: Không xác định

# StatusReadyForCheckIn
source: Ready for Check-In
vi_vn: Sẵn Sàng Check-In
